UNF16.RetailCRMИнтеграция/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9133d1ee-54e6-4556-8f42-a94010c0b021">
  <name>ЗаказПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.crm_РезервыТоваров</registerRecords>
  <attributes extendedConfigurationObject="a9208501-82e3-440e-b5d9-c5db36b9782d">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="571d8f35-5093-45ef-ac32-348e93ef2294">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c96777b7-b800-42ca-801a-01f0b5b8d2f6">
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ee6def9-9763-4cdc-ac1f-f624375bec09">
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2eeeef4-dd3b-4151-b7f9-46f5f9623778">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39cd3d5b-31c2-4c40-9842-b206bf4f8df1">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9e03101-b170-4fdc-a01c-996193bbb1ab">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00cebf6-e888-4884-a539-91933fb5e677">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1371d910-ad1b-48fe-ae24-803656eb6c75">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba7dcb3b-b8b9-4d44-ab5f-56f7a228f10d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e33dd49-eee5-4cf8-b315-72bf4d578b18">
    <name>СостояниеЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd1e7d34-4bc2-4c14-b4a7-bdb058ca9024">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fbc829c4-1bcd-4808-b01b-6b36c9122563">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1864a4fa-3bca-4347-bf6a-82bdf3e87b6f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc75100d-688a-42ed-a22d-dd728573cad6">
    <name>СтруктурнаяЕдиницаРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c037ce80-438d-4bd5-a229-6b1018139d89">
    <name>СтруктурнаяЕдиницаПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e31f38f0-d57f-4c04-a6ee-5e6e0e60f295">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="481bb258-bbe5-4a53-89fc-2cdbf9bc1ed3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="3827a494-db18-4d85-98ff-9376e84082d1">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>crm_IDпака</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>crm_idПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>crm_Склад</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>crm_КоличествоБронь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>crm_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="91499ea5-e78e-4621-b5af-36ecc6c5622a">
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="10952c6c-de05-4ec1-bd4e-821e35c83f10">
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

UNF16.RetailCRMИнтеграция/src/AccumulationRegisters/crm_РезервыТоваров/crm_РезервыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>crm_РезервыТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

UNF16.RetailCRMИнтеграция/src/Documents/ЗаказПокупателя/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаУдаленияПроведения")
Процедура crm_ОбработкаУдаленияПроведения(Отказ)

	Если не Отказ Тогда  
		
		НаборЗаписей = РегистрыНакопления.crm_РезервыТоваров.СоздатьНаборЗаписей();	
		
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект);
		
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура crm_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Заказ = &Заказ
	               |	И РасходнаяНакладная.Проведен
	               |	И НЕ РасходнаяНакладная.ПометкаУдаления";   
	
	Запрос.УстановитьПараметр("Заказ", ЭтотОбъект);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Отказ и не ПометкаУдаления и Проведен и не Выборка.Следующий() Тогда
	
		НаборЗаписей = РегистрыНакопления.crm_РезервыТоваров.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект);
		
		Для каждого товар из Запасы Цикл 
			
			Если товар.Резерв <> 0 и товар.Резерв > 0 Тогда 
				
				Запись = НаборЗаписей.Добавить();
				Запись.Количество 			= товар.Количество;
				Запись.Номенклатура 		= товар.Номенклатура;
				Запись.СтруктурнаяЕдиница 	= товар.СтруктурнаяЕдиницаРезерв;
				Запись.Регистратор 			= ЭтотОбъект;  
				Запись.ВидДвижения 			= ВидДвиженияНакопления.Приход;  
				Запись.Период				= Дата;		
				
				Если crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ИспользованиеХарактеристик") = Истина Тогда	
					Запись.Характеристика = товар.Характеристика;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		
	КонецЕсли;   
		
КонецПроцедуры

#КонецОбласти
